Public Member Functions | Public Attributes | List of all members
API_AnalyticalElemPartId Class Reference
Analytical Model
Describes the guid, contour and edge/vertex id triplet that is used for creating the API_ExportIdMappingType. More...
#include <APIdefs_AnalyticalModel.h>
 Public Member Functions
ULong  | GenerateHashValue () const
bool  | operator== (const API_AnalyticalElemPartId &right) const
 Public Attributes
API_Guid  | memberGuid
UIndex  | contourIndex
UIndex  | edgeOrVertexIndex
Detailed Description
Describes the guid, contour and edge/vertex id triplet that is used for creating the API_ExportIdMappingType.
Since
Archicad 24
Member Function Documentation
◆ GenerateHashValue()
 ULong API_AnalyticalElemPartId::GenerateHashValue  |  ( |   | ) |   const
inline
◆ operator==()
 bool API_AnalyticalElemPartId::operator==  |  ( |  const API_AnalyticalElemPartId &  |  right | ) |   const
inline
Member Data Documentation
◆ contourIndex
 UIndex API_AnalyticalElemPartId::contourIndex
◆ edgeOrVertexIndex
 UIndex API_AnalyticalElemPartId::edgeOrVertexIndex
◆ memberGuid
 API_Guid API_AnalyticalElemPartId::memberGuid